app/views/posts/myposts.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

    Uploaded by: <%= User.find(post.user_id).email %><br/>