app/views/posts/postlist.html.erb


  Uploaded by: <%= User.find(post.user_id).email %><br/>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]