app/controllers/adminpages_controller.rb

SELECT "posts".* FROM "posts"
---
  def posts_admin
    @posts = Post.all