app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["content", ""], ["created_at", "2018-07-25 18:31:46.148051"], ["updated_at", "2018-07-25 18:31:46.148051"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "f"], ["content", "f"], ["updated_at", "2018-07-26 17:02:59.139664"], ["id", 16]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT "posts".* FROM "posts"
---
  def postlist
    @posts = Post.all

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def myposts
    @posts = Post.all