app/controllers/tutorials_controller.rb

INSERT INTO "tutorials" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "graf"], ["created_at", "2018-07-20 14:27:22.610080"], ["updated_at", "2018-07-20 14:27:22.610080"]]
---
  def create
    @tutorials = Tutorial.all
    @tutorial = Tutorial.new(tutorial_params)


      if @tutorial.save