app/controllers/tutorials_controller.rb

def trythis
  @tutorials = Tutorial.all
---
SELECT "tutorials".* FROM "tutorials"

def learn
  @tutorials = Tutorial.all
---
SELECT "tutorials".* FROM "tutorials"

  def index
    @tutorials = Tutorial.all
---
SELECT "tutorials".* FROM "tutorials"

  def new
    @tutorial = Tutorial.new
    @tutorials = Tutorial.all
---
SELECT "tutorials".* FROM "tutorials"

  def create
    @tutorials = Tutorial.all
    @tutorial = Tutorial.new(tutorial_params)

      if @tutorial.save
---
INSERT INTO "tutorials" ("name", "description", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["description", "test"], ["link", "www.test.com"], ["created_at", "2018-07-24 14:38:28.960713"], ["updated_at", "2018-07-24 14:38:28.960713"]]

  def destroy
    @tutorial = Tutorial.find(params[:id])
    @tutorial.destroy
---
SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT ?  [["id", 86], ["LIMIT", 1]]
DELETE FROM "tutorials" WHERE "tutorials"."id" = ?  [["id", 129]]

  def admin
    @tutorials = Tutorial.all
---
SELECT "tutorials".* FROM "tutorials"

 def set_tutorial
   @tutorial = Tutorial.find(params[:id])
---
SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT ?  [["id", 129], ["LIMIT", 1]]