app/views/adminpages/posts_admin.html.erb

        <td><%= post.content %></td>
        <td><%= User.find(post.user_id).email %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]